In [14]:
import pandas as pd
import numpy as np
df=pd.read_csv(r"C:\Users\ABHISHEK YADAV\Downloads\school_marks_dataset.csv")
df['Total']=df[['Maths','Science','English','Hindi']].sum(axis=1)
df['Percentage']=df['Total']/4
df

   Roll_No      Name  Class  Maths  Science  English  Hindi  Total  Percentage
0        1     Rahul     10     78       82       75     80    315       78.75
1        2    Anjali     10     88       90       85     87    350       87.50
2        3      Aman     10     65       70       68     72    275       68.75
3        4      Neha     10     92       95       90     93    370       92.50
4        5  Abhishek     10     55       60       58     62    235       58.75

In [3]:
def Grade(x):
    if x > 90:
        return ('A')
    elif x >80:
        return ('B')
    elif x >70:
        return ('C')
    else:
        return ('D')

df['Grade']=df['Percentage'].apply(Grade)
df

,Roll_No,Name,Class,Maths,Science,English,Hindi,Total,Percentage,Grade
0,1,Rahul,10,78,82,75,80,315,78.75,C
1,2,Anjali,10,88,90,85,87,350,87.50,B
2,3,Aman,10,65,70,68,72,275,68.75,D
3,4,Neha,10,92,95,90,93,370,92.50,A
4,5,Abhishek,10,55,60,58,62,235,58.75,D

In [4]:
df['Rank']=df['Percentage'].rank(ascending=False,method='dense').astype(int)
df
df[df.Total==df['Total'].max()]

,Roll_No,Name,Class,Maths,Science,English,Hindi,Total,Percentage,Grade,Rank
3,4,Neha,10,92,95,90,93,370,92.5,A,1

In [20]:
# practics some questions on this data

df=pd.read_csv(r"C:\Users\ABHISHEK YADAV\Downloads\employee_salary_dataset.csv")
df

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752

In [21]:
df['Name'].count()

np.int64(50)

In [22]:
df['Department'].nunique()

5

In [25]:
df[df['Department']=='IT']

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491

In [26]:
df[df['Gender']=='Female']

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752

In [34]:
a=df[df['City']=='Delhi']
a['City'].count()

np.int64(15)

In [35]:
df['Age'].mean()

np.float64(39.76)

In [44]:
 
df.loc[df['Monthly_Salary'].idxmax()]

EmployeeID                   38
Name                Employee_38
Department           Operations
Experience_Years              9
Education_Level          Master
Age                          23
Gender                     Male
City                     Mumbai
Monthly_Salary           149123
Name: 37, dtype: object